Revit 2024 API
ParameterTypeId.DoorFrameType Property
 "Frame Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DoorFrameType { get; }
Visual Basic
Public Shared ReadOnly Property DoorFrameType As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DoorFrameType {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace